src/DataProcessors/ПомощникСозданияОбменаДаннымиССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ПомощникСозданияОбменаДаннымиССайтом</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСайта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьКартинки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстаткиПоСкладам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДляНовойНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДляНовыхКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиЗаказов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентныеЗадания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменЗаказами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменТоварами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьТолькоНеПроведенныеЗаказыПриЗагрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеРегламентногоЗадания</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненнаяТаблицаКаталогов</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособИдентификацииКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыИдентификацииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиДатыОтгрузкиЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУстановкиДатыОтгрузкиЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиДатыОтгрузкиЗаказаКоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаУзелОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменУправлениеНебольшойФирмойСайт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколОбменаCMS</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПротоколыОбменаCMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ВидыОтборовНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОтборовНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГруппыНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КатегорииНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СегментыНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ПомощникСозданияОбменаДаннымиССайтом/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ВыполнитьДействияПоСозданиюНовогоОбменаДанными(Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		НовыйУзел = ПланыОбмена.ОбменУправлениеНебольшойФирмойСайт.СоздатьУзел();
		НовыйУзел.УстановитьНовыйКод();
		
		ЗаполнитьЗначенияСвойств(НовыйУзел, ЭтотОбъект);
		
		Для каждого СтрокаТаблицы Из ВидыЦен Цикл
			
			НоваяСтрока = НовыйУзел.ВидыЦен.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
		КонецЦикла;
		
		Если НЕ ВыгружатьНаСайт Тогда 
			
			НовыйУзел.ФайлЗагрузки = СокрЛП(КаталогЗагрузки) + "\Orders.xml";
			
		КонецЕсли;
		
		Если ОбменТоварами И ОбменЗаказами Тогда
			
			НаименованиеОбмена = "Обмен товарами и заказами с WEB - сайтом";
			
		ИначеЕсли ОбменТоварами Тогда
			
			НаименованиеОбмена = "Выгрузка товаров на WEB - сайт";
			
		Иначе
			
			НаименованиеОбмена = "Обмен заказами с WEB - сайтом";
			
		КонецЕсли;
		
		НовыйУзел.Наименование = НаименованиеОбмена + " (" + СокрЛП(НовыйУзел.Код) + ")";
		
		Если ИспользоватьРегламентныеЗадания
			И РасписаниеРегламентногоЗадания <> Неопределено Тогда 
			
			ИдентификаторЗадания = ОбменССайтомРегламентныеЗадания.СоздатьНовоеЗадание(НовыйУзел.Код, НовыйУзел.Наименование, РасписаниеРегламентногоЗадания);
			НовыйУзел.ИдентификаторРегламентногоЗадания = ИдентификаторЗадания;
			
		КонецЕсли;
		
		НовыйУзел.ОтборГруппыКатегорииНоменклатуры = Перечисления.ВидыОтборовНоменклатуры.ГруппыНоменклатуры;
		НовыйУзел.ВыполнятьПолнуюВыгрузкуПринудительно = Истина;
		НовыйУзел.НастройкиПоискаКонтрагентов = ОбменССайтом.ЗаписьJSONВСтруктуру(ОбменССайтом.ПоляПоискаКонтрагентовПоУмолчанию());
		
		НовыйУзел.ПереходАдресСайта = "<Введите адрес перехода на сайт>";
		НовыйУзел.ПереходURLАдминЗоны = "<Введите адрес перехода в админзону сайта>";
		
		НовыйУзел.Записать();
		
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(НовыйУзел.Ссылка, Пароль);
		
		ОбменССайтом.ОбновитьПараметрыСеанса();
		
		СсылкаНаУзелОбмена = НовыйУзел.Ссылка;
		
	Исключение
		
		ТекстСообщения = НСтр("ru = 'При сохранении настроек обмена данными возникла ошибка: '");
		
		ОбменДаннымиСервер.СообщитьОбОшибке(ТекстСообщения + ОписаниеОшибки(), Отказ);
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		
	КонецПопытки;
	
	Если Отказ Тогда
		
		ОтменитьТранзакцию();
		
	Иначе
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
